Spok1978/hybrid-radio/firmware/sdkconfig.defaults
# Значения по умолчанию для IP-Radio.
#
# Обновлено 2026-08-27. Вчера здесь стояло три строки, потому что имена
# символов Kconfig я угадывать отказалась. Теперь их не надо угадывать:
# ESP-ADF склонирован, и в нём есть готовый набор под нашу цель —
# examples/player/pipeline_http_mp3/sdkconfig.defaults.esp32p4.
# Ниже взято оттуда всё, что относится к кристаллу, и НЕ взято то,
# что относится к чужой плате.

CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y
CONFIG_IDF_TARGET_ARCH_RISCV=y

# Частота ядра.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=360

# Ревизия кристалла. n означает «ревизия 3.1 и выше».
# ЕСЛИ проверочная программа покажет 1.x — переставить в y.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=n

# PSRAM: в неё лягут буфер потока и рабочая память декодера.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# Wi-Fi через сопроцессор ESP32-C6.
# Ключ ESP_WIFI_REMOTE_LIBRARY_HOSTED подтверждён: он стоит именно так
# в официальном наборе ADF под P4. Раньше был известен только по
# поисковой выдаче и помечен как непроверенный.
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y

# Буферы под поток. Значения из набора ADF: интернет-радио — ровно тот
# сценарий, под который они и подбирались.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_TX_BA_WIN=32
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_RX_BA_WIN=32

CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SACK_OUT=y

# Флеш на плате 32 МБ (GD25Q256EYIGR, подтверждено схемой).
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y

# Своя таблица разделов, состав — partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --------------------------------------------------------------------
# ЧЕГО ЗДЕСЬ СОЗНАТЕЛЬНО НЕТ
# --------------------------------------------------------------------
# CONFIG_ESP32_P4_FUNCTION_EV_BOARD=y — в наборе ADF эта строка есть,
#   но она выбирает звуковой HAL под плату Espressif EV-Board. У нас
#   плата Waveshare, и её в списке звуковых плат ADF нет. Нам это
#   и не нужно: звук идёт мимо штатного кодека, через свой PCM5102A
#   по I²S (docs/26-firmware-spec.md, §2.5).
#
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y — в наборе ADF консоль уведена
#   на USB-Serial/JTAG, потому что так устроен их стенд. У нашей платы
#   есть мост CH343P на GPIO37/GPIO38, и консоль удобнее оставить на нём.
#
# CONFIG_LVGL_PORT_ENABLE_PPA — поворот кадра. Появится, когда в проект
#   придёт порт LVGL; сейчас этого символа ещё нет.
